Revit 2027 API
PaperSourceSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	PaperSource item
)
Public Overridable Function Insert (
	item As PaperSource
) As Boolean
public:
virtual bool Insert(
	PaperSource^ item
)
abstract Insert :
        item : PaperSource -> bool
override Insert :
        item : PaperSource -> bool
Parameters
item PaperSource
Return Value
Boolean
See Also
Reference
PaperSourceSet Class
Autodesk.Revit.DB Namespace